# 12.3 Data Formatting
## 수치값을 카테고리값으로 변환하기

In [1]:
#p189
import numpy as np
import pandas as pd
price = np.random.randint(100, size=8)*10000
cars = pd.DataFrame(price, columns=['price'])
cars

    price
0  270000
1  500000
2  900000
3   50000
4   20000
5   60000
6  300000
7  720000

In [2]:
group_names = ['저급', '중급', '고급']
cars['level'], mybin = pd.cut(cars['price'], 3, labels=group_names, retbins=True)
cars

    price level
0  270000    저급
1  500000    중급
2  900000    고급
3   50000    저급
4   20000    저급
5   60000    저급
6  300000    저급
7  720000    고급

In [3]:
#p190
print(mybin)

[ 19120.         313333.33333333 606666.66666667 900000.        ]

## 카테고리값을 수치값으로 변환하기

In [4]:
#p191
import pandas as pd
import numpy as np
ary = [[1, 1.1, '손'], [2, 2.2, '날개'], [3, 3.3, '손']]
data = pd.DataFrame(ary, columns=['수온', '상온', 'hand'])
pd.get_dummies(data['hand'])

   날개  손
0   0  1
1   1  0
2   0  1

In [5]:
import pandas as pd
import numpy as np
ary = [[1, 1.1, '손'], [2, 2.2, '날개'], [3, 3.3, '손']]
data = pd.DataFrame(ary, columns=['수온', '상온', 'hand'])
data = pd.concat([data, pd.get_dummies(data['hand'])], axis=1, sort=False)
data

   수온   상온 hand  날개  손
0   1  1.1    손   0  1
1   2  2.2   날개   1  0
2   3  3.3    손   0  1

In [6]:
data.drop(['hand'], axis=1, inplace=True)
data

   수온   상온  날개  손
0   1  1.1   0  1
1   2  2.2   1  0
2   3  3.3   0  1